# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
frist=pd.Series(np.random.randint(1 , high=5 , size=100, dtype="l"))
second=pd.Series(np.random.randint(1, high=4 ,size=100 ,dtype="l"))
third=pd.Series(np.random.randint(10000,high=30001, size=100,dtype="l"))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
housemkt=pd.concat([frist,second,third] ,axis=1)
housemkt

    0  1      2
0   4  1  13424
1   2  1  14275
2   2  3  13667
3   1  2  29768
4   1  3  26486
.. .. ..    ...
95  2  1  19063
96  2  3  14718
97  3  2  18689
98  1  1  21823
99  4  1  16395

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
housemkt.rename(columns={0:"bedrs",1:" bathrs",2:" price_sqr_meter"} , inplace=True)
housemkt

    bedrs   bathrs   price_sqr_meter
0       4        1             13424
1       2        1             14275
2       2        3             13667
3       1        2             29768
4       1        3             26486
..    ...      ...               ...
95      2        1             19063
96      2        3             14718
97      3        2             18689
98      1        1             21823
99      4        1             16395

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
big=pd.concat([frist,second,third])
big=big.to_frame()
big

        0
0       4
1       2
2       2
3       1
4       1
..    ...
95  19063
96  14718
97  18689
98  21823
99  16395

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
len(big)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
big.reset_index(drop=True, inplace=True)

In [8]:
big

         0
0        4
1        2
2        2
3        1
4        1
..     ...
295  19063
296  14718
297  18689
298  21823
299  16395

[300 rows x 1 columns]